system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application        chtMultiRegionFoam;
startFrom          latestTime;
startTime          0;
stopAt             endTime;
endTime            10000;
deltaT             1;
writeControl       timeStep;
writeInterval      50;
purgeWrite         0;
writeFormat        ascii;
writePrecision     8;
writeCompression   off;
timeFormat         general;
timePrecision      6;
runTimeModifiable  yes;
maxCo              5;
maxDi              10.0; // Maximum diffusion number
adjustTimeStep     no;

// ************************************************************************* //
