constant/hot/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  1.5                                   |
|   \  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    hot_in
    {
        type                 patch;
        nFaces               506;
        startFace            742941;
    }
    hot_out
    {
        type                 patch;
        nFaces               494;
        startFace            743447;
    }
    hot_pipe_hot
    {
        type                 mappedWall;
        nFaces               21312;
        startFace            743941;
        startFace            743941;
        sampleMode           nearestPatchFace;
        sampleRegion         solid;
        samplePatch          hot_pipe_solid;
        offsetMode           uniform;
        offset               ( 0 0 0 );
    }
    hot_w1
    {
        type                 wall;
        nFaces               1520;
        startFace            765253;
    }
    hot_w2
    {
        type                 wall;
        nFaces               1440;
        startFace            766773;
    }
)

// ************************************************************************* //


