0/hot/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

value           (1 0 0);
internalField   uniform (0 0 0);

boundaryField
{
    hot_in
    {
        type            fixedValue;
        value           uniform $value;
    }
    hot_out
    {
        type            zeroGradient;
        value           uniform $value;
    }
    "hot_w.*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    hot_pipe_hot
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
