0/cold/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

value           0;
internalField   uniform $value;

boundaryField
{
    cold_in
    {
        type            zeroGradient;
        value           uniform $value;
    }
    cold_out
    {
        type            fixedValue;
        value           uniform $value;
    }
    "cold_w.*"
    {
        type            buoyantPressure;
        value           uniform $value;
    }
    cold_pipe_cold
    {
        type            buoyantPressure;
        value           uniform $value;
    }
}


// ************************************************************************* //
