0/hot/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

value           375;
internalField   uniform $value;

boundaryField
{
    hot_in
    {
        type            fixedValue;
        value           uniform $value;
    }
    hot_out
    {
        type            zeroGradient;
        value           uniform $value;
    }
    "hot_w.*"
    {
        type            compressible::omegaWallFunction;
        value           uniform $value;
    }
    hot_pipe_hot
    {
        type            compressible::omegaWallFunction;
        value           uniform $value;
    }
}


// ************************************************************************* //
