0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

value           293.15;
internalField   uniform $value;

boundaryField
{
    "solid_.*"
    {
        type            zeroGradient;
        value           uniform $value;
    }
    cold_pipe_solid
    {
        type               compressible::turbulentTemperatureCoupledBaffleMixed;
        value              uniform $value;
        neighbourFieldName T;
        K                  solidThermo;
        KName              none;
    }
    hot_pipe_solid
    {
        type               compressible::turbulentTemperatureCoupledBaffleMixed;
        value              uniform $value;
        neighbourFieldName T;
        K                  solidThermo;
        KName              none;
    }
}


// ************************************************************************* //
